experiments/data/stats/ycsb_c_run4.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadc -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 14393
[OVERALL], Throughput(ops/sec), 69478.21857847564
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 33
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.22927812130896963
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 33
[TOTAL_GC_TIME_%], Time(%), 0.22927812130896963
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3234816.0
[CLEANUP], MinLatency(us), 3233792
[CLEANUP], MaxLatency(us), 3235839
[CLEANUP], 50thPercentileLatency(us), 3235839
[CLEANUP], 95thPercentileLatency(us), 3235839
[CLEANUP], 99thPercentileLatency(us), 3235839
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.833715
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 52063
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 14
[INSERT], 99thPercentileLatency(us), 24
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadc -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 18157
[OVERALL], Throughput(ops/sec), 55075.177617447815
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 18
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.09913531971140607
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.09913531971140607
[READ], Operations, 1000000
[READ], AverageLatency(us), 14.185814
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 11151
[READ], 50thPercentileLatency(us), 10
[READ], 95thPercentileLatency(us), 51
[READ], 99thPercentileLatency(us), 67
[READ], Return=OK, 1000000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 167872.0
[CLEANUP], MinLatency(us), 167808
[CLEANUP], MaxLatency(us), 167935
[CLEANUP], 50thPercentileLatency(us), 167935
[CLEANUP], 95thPercentileLatency(us), 167935
[CLEANUP], 99thPercentileLatency(us), 167935