experiments/data/stats/ycsb_c_run5.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadc -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 12020
[OVERALL], Throughput(ops/sec), 83194.6755407654
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 30
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.24958402662229617
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 0.24958402662229617
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1624576.0
[CLEANUP], MinLatency(us), 1624064
[CLEANUP], MaxLatency(us), 1625087
[CLEANUP], 50thPercentileLatency(us), 1625087
[CLEANUP], 95thPercentileLatency(us), 1625087
[CLEANUP], 99thPercentileLatency(us), 1625087
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.092378
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 24079
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 18
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadc -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 18057
[OVERALL], Throughput(ops/sec), 55380.1849698178
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 14
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.07753225895774492
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 14
[TOTAL_GC_TIME_%], Time(%), 0.07753225895774492
[READ], Operations, 1000000
[READ], AverageLatency(us), 14.276268
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 9679
[READ], 50thPercentileLatency(us), 10
[READ], 95thPercentileLatency(us), 52
[READ], 99thPercentileLatency(us), 67
[READ], Return=OK, 1000000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 20824.0
[CLEANUP], MinLatency(us), 20816
[CLEANUP], MaxLatency(us), 20831
[CLEANUP], 50thPercentileLatency(us), 20831
[CLEANUP], 95thPercentileLatency(us), 20831
[CLEANUP], 99thPercentileLatency(us), 20831